# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names = pd.read_csv(r"E:\#\US_Baby_Names_right.csv", sep=",")
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names = baby_names.drop(["Unnamed: 0","Id"], axis=1)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [10]:
baby_names[["Gender","Year"]].groupby(by=["Gender"]).Year.count()

Gender
F    558846
M    457549
Name: Year, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [12]:
names = baby_names.groupby(by=["Name"])

### Step 8. How many different names exist in the dataset?

In [16]:
len(names)
baby_names.Name.nunique()

17632

### Step 9. What is the name with most occurrences?

In [56]:
names.count().sort_values("Year", ascending=False).iloc[1,:]
names.Count.idxmax()

Name
Aaban      693699
Aadan      120728
Aadarsh    323950
Aaden      121886
Aadhav     138429
            ...
Zyra       884656
Zyrah      881583
Zyren      910625
Zyria      237366
Zyriah     862166
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [36]:
lessNum = names.count().sort_values("Year", ascending=False).iloc[-1,:].Year

names.count()[names.count()["Year"] == lessNum].shape[0]

3682

### Step 11. What is the median name occurrence?

In [48]:
grp = names.Year.count()
grp[grp==grp.median()]

Name
Abubakar    8
Adelie      8
Adira       8
Adylene     8
Aerial      8
           ..
Zamaya      8
Zanaya      8
Zari        8
Zaylie      8
Zyanna      8
Name: Year, Length: 360, dtype: int64

### Step 12. What is the standard deviation of names?

In [50]:
names.Year.count().std()

122.02996350814125

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [55]:
pd.DataFrame(names.Year.count()).describe()

               Year
count  17632.000000
mean      57.644907
std      122.029964
min        1.000000
25%        2.000000
50%        8.000000
75%       39.000000
max     1112.000000